Revit 2026 API

# MechanicalEquipment Properties

---

The MechanicalEquipment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectorManager | Retrieves the Connector Manager from this MEPModel. (Inherited from MEPModel) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from MEPModel) |

#### Reference

MechanicalEquipment Class

Autodesk.Revit.DB.Mechanical Namespace